app/controllers/pages_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC
---
  def home
    @posts = Post.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
  def profile
    # grab username from the URL as :id
    if (User.find_by_username(params[:id]))
      @username = params[:id]
    else
      # redirect to 404 (root for now)
      redirect_to root_path, :notice=> "User not found!"
    end

    @posts = Post.all.where("user_id = ?", User.find_by_username(params[:id]).id) # give every single post in database